package com.Max.bam.data.data_example;

import com.Max.bam.data.entity.ThemeCard;

import java.util.ArrayList;
import java.util.List;

public abstract class ThemeCardsPrepopulator {
    public static List<ThemeCard> getThemeCards(){
        List<ThemeCard> themeCards = new ArrayList<>();
        themeCards.add(new ThemeCard("Интересные факты о дельфинах", "Дельфины не рыбы. Несмотря на то, что дельфины живут в воде и выглядят подобно другим морским жителям, они гораздо ближе к людям, чем кажется. Дельфин — теплокровное животное, которое рожает детёнышей и кормит их молоком, а не мечет икру. У него нет чешуи, вместо этого тело покрыто гладкой и нежной кожей. Даже плавники дельфинов устроены по-другому. В плавниках дельфинов, в отличие от плавников рыб, есть плечевые кости и даже нечто похожее на фаланги пальцев. Скорее всего, дельфины когда-то жили на земле, но в процессе эволюции вернулись в море. Дельфины обладают невероятной способностью к самоисцелению. В случае получения какой-либо раны — даже большого размера — они не истекают кровью и не погибают от заражения, как можно было бы предположить. Вместо этого их плоть начинает быстрыми темпами восстанавливаться, так что всего через несколько недель на месте глубокой раны, например от зубов акулы, почти не остаётся видимых шрамов. Интересно, что поведение травмированных животных практически не отличается от обычного. Это даёт основания полагать, что нервная система дельфинов способна в критических ситуациях блокировать болевые ощущения.", "https://lifehacker.ru/7-facts-about-dolphins/"));
        themeCards.add(new ThemeCard("9 видов влияния звука на наше здоровье, самочувсмтвие и работоспособность", "\"1. Средняя цена, в которую выливается чрезмерный шум, составляет 30 800 000 000 в год – а ведь это только в Европе.\n" +
                "2. Каждый год, шум отнимает день жизни у всех взрослых и детей. Ужасающе, но было установлено, что каждые 365 дней, суммарная продолжительность жизни в Европе теряет один миллион лет – что равняется примерно одному дню на человека.\n" +
                "3. Если вы слышите чью-то речь, в то время, как читаете или пишите, то ваша продуктивность падает на 66%. \n" +
                "4. Нынешний средний уровень шума в большинстве учебных классов влечет за собой не только плохую успеваемость, но может в дальнейшем даже стать причиной потери слуха. Да, шум влияет и на учебу. Всемирная организация здравоохранения рекомендует уровень шума в кабинетах до библиотечных стандартов – а именно, 35 дБ. Однако согласно проведенному в Германии проекту, уровень шума в кабинетах соответствует 65 дБ , уровню, ассоциируемому с потерей слуха.\n" +
                "5. Увеличения уровня шума, производимого воздушными судами на 20 дБ достаточно для того, чтобы задержать прогресс учащегося в чтении на 8 месяцев.\n" +
                "6. 50% учителей теряли голос, читая лекции в шумном классе.\n" +
                "7. Средний уровень зашумленности в некоторых больницах не только замедляет процесс восстановления, но ставит обусловленную законом необходимость предоставления средств для защиты слуховых органов.\n" +
                "8. 3% случаев остановок сердца в Германии были вызваны дорожно-транспортным шумом.\n" +
                "9. Высокая зашумленность может даже толкнуть на криминальную тропу. После того, как по всему Ланкастеру (штат Калифорния) через каждые полмили было установлено оборудование с записанным на него пением птиц, уровень преступности снизился на 15%, согласно статье в Wall Street Journal. Точно так же, по информации из газеты The Independent, когда в Лондонском метро на станциях с особо повышенным уровнем преступности зазвучала классическая музыка, кражи упали на 33%, а нападения на сотрудников снизились на 25%. \"" , "http://tedrus.com/ted-talks-9-vidov-vliyaniya-zvuka-na-nashe-zdorove-samochuvstvie-i-rabotosposobnost/"));
        themeCards.add(new ThemeCard("Критическое мышление", "\"Критическое мышление — это система суждений, которую применяют для анализа вещей и информации, интерпретации явлений, оценки событий, а также для последующего составления объективных выводов. Критическое мышление — это важный soft skill. Человек с развитым критическим мышлением обладает целым набором навыков — это наблюдательность и умение обосновать свою точку зрения, сосредоточенность на изучении информации и способность применять аналитические навыки в самых разных ситуациях. Где может пригодиться критическое мышление?\n" +
                "Везде. Это не преувеличение: умение критически мыслить может пригодиться в любой сфере нашей жизни — как детям и подросткам, так и взрослым.\n" +
                "Человек, который обладает критическим мышлением, способен: понимать логические и причинно-следственные связи между разными идеями и понятиями; быстро анализировать суждения окружающих и оценивать их; грамотно конструировать собственные аргументы и доносить их до окружающих; замечать нестыковки, несоответствия и обыденные ошибки в логике и аргументации; отмечать важность и релевантность идей общему контексту; рефлексивно оценивать собственные мнения и верования.\n" +
                "Как развивать критическое мышление?\n" +
                "Научиться критическому мышлению сразу не получится. Это как изучение иностранного языка — сначала все кажется сложным и непонятным, но когда понимаешь логику, становится проще.\n" +
                "Чтобы развить критическое мышление, отрабатывайте навык на конкретных кейсах. Поставьте под сомнения тезисы и аргументы этой статьи, проверьте ссылки на исследования или компетентность экспертов. Затем — научитесь работать с инструментами критического мышления: пользоваться методиками проверки информации; учитывать когнитивные искажения; не попадаться на ошибки аргументации; выходить из информационных пузырей.\n" +
                "\n" +
                "\"", "https://trends.rbc.ru/trends/education/5e0608ea9a7947fa3c1bcf34"));
        themeCards.add(new ThemeCard("Как появиись знаки зодиака?", "\"Первое деление неба на 12 частей появилось на территории современного Ирана — Вавилона — Шумерской цивилизацией. Издревле разные племена говорили о том, что знаки зодиака появились от богов. Шумеры же были уверены, что знаки зодиака — это боги, пришедшие с Млечного пути. Древние жители обратили внимание на то, что каждый месяц на востоке виднеются одни и те же знаки.\n" +
                "\n" +
                "Разделение приняли всемирно, несмотря на то, что через эклиптику (большой круг: годичное движение Солнца) проходит 13 созвездий. Мало кто знает о существовании змееносца, потому что его выкинули из-за несчастного числа 13.\n" +
                "\n" +
                "Секреты названий знаков зодиака\n" +
                "Овен: миф о баране, похитившем царских детей. Один из них отдал барана Зевсу, а тот оставил его на небе.\n" +
                "Телец: по легенде Зевс превращался в быка и в этом обличие украл богиню Европу — оставил ее на острове Крит.\n" +
                "Близнецы: в честь сыновей Кастора и Полидевка, чьи родители основали Рим.\n" +
                "Рак: именно он помешал во втором сражении Геракла с Гидрой, вцепившись герою в ногу. Мертвого рака оставили на небе.\n" +
                "Лев: его убил Геракл во время первого и и самого сложного сражения.\n" +
                "Девы: в честь Деметры — древнегреческой богини плодородия.\n" +
                "Весы: в честь богини правосудия Фемиды.\n" +
                "Скорпион: ужалил противника Артемиды, помогая ей одолеть соперника.\n" +
                "Стрелец: в честь кентавра Хирона.\n" +
                "Козерог: в честь сельского бога Пана.\n" +
                "Водолей: древнейший символ древнегреческого происхождения.\n" +
                "Рыбы: Афродита и Эрос бежали, превратившись в рыб.\"", "https://www.5-tv.ru/news/257352/istoria-poavlenia-goroskopov-iinteresnye-fakty-oznakah-zodiaka/"));
        themeCards.add(new ThemeCard("Харизма", "\"Что такое харизма?\n" +
                "Харизма — это наделенность авторитетом, основанным на исключительных качествах личности: интеллектуальных, духовных или каких-либо иных.\n" +
                "\n" +
                "Невидимую силу, позволяющую отдельным личностям увлекать за собой других, первыми начали исследовать древние греки. Они назвали ее харизмой (на др.-греч. χάρισμα), в буквальном переводе — «дар свыше» или «милость богов». Другим значением этого слова была «способность привлекать внимание». Этим умением в полной мере обладали хариты — три богини в древнегреческой мифологии, олицетворяющие красоту, изящество и привлекательность. Своим шармом и добротой они вызывали восхищение людей и любовь богов.\n" +
                "\n" +
                "При этом опыт современных исследователей в области психологии показывает, что древние греки ошибались, считая харизму врожденным даром. Так, психолог и научный руководитель исследовательского центра в Стэнфордском университете Эмма Сеппала отмечает, что это харизма «в гораздо большей степени навык, которому можно научиться, чем дар».\n" +
                "\n" +
                "Зачем развивать харизму?\n" +
                "Прокаченная харизма:\n" +
                "Служит топливом для достижения целей.\n" +
                "Компенсирует пробелы в подготовке или квалификации.\n" +
                "Умножает результаты в работе. \n" +
                "Для руководителей — выводит управление на качественно новый уровень.\n" +
                " \n" +
                "Как развивать харизму?\n" +
                "Работать над самопрезентацией\n" +
                "Налаживать контакт с окружающими\n" +
                "Использовать внутренние или ментальные техники\n" +
                " \"", "https://trends.rbc.ru/trends/social/61f8f4dc9a79475d8b89c267"));
        themeCards.add(new ThemeCard("\"Как видят кошки?\n" +
                "\"", "\"Зрение – это механизм, благодаря которому животные и люди изучают окружающий мир и воспринимают его сигналы. Некоторые млекопитающие, например люди, полагаются на зрение в большей степени, другие – в меньшей. К таким животным и относятся кошки. Зрение для них – не главные способ восприятия окружающего мира, но, несомненно, очень важный.\n" +
                "\n" +
                "Несмотря на то, что основное строение глаза кошки схоже со строением глаз других животных, есть и различия, самое очевидное из которых – форма зрачков. Зрачок у кошек способен существенно менять свою форму, в зависимости от количества поступающего света. Кошка видит ночью все предметы в серых тонах. Несмотря на то, что эти животные способны хорошо видеть в условиях плохой освещенности, в полной темноте они все же не видят. Им нужен хотя бы маленький источник света, такой как, например, луна и звезды\n" +
                "\n" +
                "Кошки обладают очень острым зрением, превышающим остроту человеческого глаза в семь раз. Однако острота зрения необходима для распознавания движущихся объектов, в то время как статичные предметы ими воспринимаются хуже.\n" +
                "\n" +
                "Возможно, вы замечали во время игры, что ваш питомец лучше фокусируется на тех объектах, которые движутся в горизонтальной плоскости. Движения в вертикальной плоскости кошкам распознать сложнее.\n" +
                "\n" +
                "Цветовой спектр, который способен воспринимать кошачий глаз, отличается от того, который видит человек. Плохо кошачий глаз различает белый, фиолетовый и желтый цвета, а между синим и голубым почти не «видит» разницу. Наиболее восприимчивы кошачьи глаза к зеленому, синему и серому цветам. Поскольку эти цвета они видят лучше всего, мир с точки зрения питомца принимает голубовато-серый оттенок, а солнце – зелено-голубой.\n" +
                "Лучше всего кошки воспринимают серый цвет – их глаза различают более двадцати оттенков серого цвета, поскольку это цвет той дичи, на которую они в природе охотятся (мыши, крысы, некоторые птицы).\"", "https://www.royalcanin.com/ru/cats/understanding-your-cat/kak-vidyat-koshki"));
        themeCards.add(new ThemeCard("Интересные факты о русском языке", "\"1) Огромное количество слов в русском языке, которые имеют букву Ф, заимствовались из других языков.\n" +
                "\n" +
                "2) С буквы Й в русском языке начинается только 74 слова.\n" +
                "\n" +
                "3) В русском языке есть слова, которые начинаются на букву Ы. Интересные факты про русский язык говорят, что это названия некоторых рек и городов: Ыгыатта, Ыллымах, Ынахсыт, Ыныкчанский, Ытык-кюёль.\n" +
                "\n" +
                "4) Слова бык и пчела — однокоренные. В произведениях древнерусской литературы слово пчела писалось как бъчела. Чередование гласных ъ / ы объясняется происхождением обоих звуков из одного индоевропейского звука u. Если вспомнить диалектный глагол бучать, имеющий значения «реветь», «гудеть», «жужжать» и этимологически родственный словам пчела, букашка и бык, то становится ясным, каково же было общее значение этих слов\n" +
                "\n" +
                "5) Даль предлагал заменить иностранное слово атмосфера на русские колоземица или мироколица.\n" +
                "\n" +
                "6) В Грамматическом словаре русского языка А. А. Зализняка издания 2003 года самая длинная (в буквах) нарицательная лексема в словарной форме — это прилагательное частнопредпринимательский, которое состоит из 25 букв.\n" +
                "\n" +
                "7) В Книге рекордов Гиннесса 1993 года самым длинным словом русского языка названо рентгеноэлектрокардиографического, в издании 2003 года — превысокомногорассмотрительствующий.\n" +
                "\n" +
                "8) Самые длинные одушевленные существительные — одиннадцатиклассница и делопроизводительница (по 21 букве, словоформы -ами — по 23 буквы)\n" +
                "\n" +
                "9) Англичане для успешного усвоения трудной фразы «я люблю вас» пользуются мнемоникой «yellow-blue bus».\n" +
                "\"", "http://susumanschool1.edusite.ru/p220aa1.html"));
        themeCards.add(new ThemeCard("Карты Таро", "\"Каарты таро́ — колода карт, используемая для карточных игр (итальянский tarocchi, французский tarot и австрийский Königrufen), во многие из которых играют и сегодня. С конца XVIII века карты таро стали использоваться и для гадания. До сих пор неизвестно, где и когда началось гадание Таро. Существовали версии об их возникновении в Египте и Китае. Но принято считать, что гадание возникло в начале 15-го века в Италии.\n" +
                "\n" +
                "Карты Таро применяют в своей практике некоторые психологи. Они предлагают вытянуть из колоды карту, с которой клиент себя ассоциирует. Это дает возможность врачу понять, как человек себя видит со стороны.\n" +
                "\n" +
                "Нет единого толкователя значения символов Таро, каждый таролог рассматривает выпавший расклад по-своему. Именно поэтому важно обращаться к проверенным специалистам. Предсказание будет максимально правильным, если сразу четко сформулировать интересующий вопрос.\n" +
                "\n" +
                "Гадание на Таро применялось даже в Советском Союзе, на изображениях была символика СССР. Но его признали антинаучным и запретили.\n" +
                "\n" +
                "Таро является самым популярным гаданием в мире. Согласно американской статистике, двое из пяти человек постоянно посещают таролога. Символика карт не обошла стороной даже мир моды: Dior i Gucci используют изображение в своих коллекциях.\n" +
                "\n" +
                "Ранее карты Таро предназначались для прорицания, ныне их применяют также для контакта со своим внутренним «Я» и для гармонизации отношений со вселенной.\n" +
                "\n" +
                "Зачастую гадание считается грехом, но нигде нет запрета на карты Таро. До сегодняшнего дня принцип работы символов так и остается полностью не раскрытым.\"", "https://konkurent.ru/article/37204#:~:text=%D0%93%D0%B0%D0%B4%D0%B0%D0%BD%D0%B8%D0%B5%20%D0%BD%D0%B0%20%D0%A2%D0%B0%D1%80%D0%BE%20%D0%BF%D1%80%D0%B8%D0%BC%D0%B5%D0%BD%D1%8F%D0%BB%D0%BE%D1%81%D1%8C%20%D0%B4%D0%B0%D0%B6%D0%B5,%D0%BF%D1%8F%D1%82%D0%B8%20%D1%87%D0%B5%D0%BB%D0%BE%D0%B2%D0%B5%D0%BA%20%D0%BF%D0%BE%D1%81%D1%82%D0%BE%D1%8F%D0%BD%D0%BD%D0%BE%20%D0%BF%D0%BE%D1%81%D0%B5%D1%89%D0%B0%D1%8E%D1%82%20%D1%82%D0%B0%D1%80%D0%BE%D0%BB%D0%BE%D0%B3%D0%B0."));
        themeCards.add(new ThemeCard("Интересное о грибах", "\"1. Существуют грибы-хищники.\n" +
                "Плотоядные виды появились не раньше чем 100 миллионов лет назад и за это время изобрели множество хитростей. Например, одни из них сплетают из своих нитей-гифов петли и ждут, пока туда заползёт какой-нибудь червячок, а затем затягивают узел и переваривают жертву.\n" +
                "2. Из грибов можно делать мороженое.\n" +
                "3. И стройматериалы.\n" +
                "4. С помощью грибов можно разжечь огонь.\n" +
                "5. И даже сделать из них шапку.\n" +
                "6. Грибы вырабатывают ракетное топливо.\n" +
                "7. Грибы контролируют насекомых, чтобы размножаться.\n" +
                "Есть грибы, которые предпочитают паразитировать на телах других живых существ. Они буквально пожирают хозяев заживо. И некоторым носителям это даже нравится.\n" +
                "Например, паразитарный гриб массоспора живёт на тельцах цикад. Несчастные насекомые буквально разлагаются, пока он их поедает. Но они не переживают — ведь массоспора вводит им в кровеносную систему псилоцибин и катинон (аналог амфетамина).\n" +
                "8. Грибы производят облака.\n" +
                "Исследователи Института химии им. Макса Планка в Германии обнаружили занятный факт. В лесах Амазонки некоторые виды грибов запускают в воздух органические частицы, которые поднимаются в небо и попадают в облака.\n" +
                "Там эти микроскопические соединения углерода и калия за счёт химических процессов притягивают и конденсируют воду. Это приводит к образованию облаков, а затем — дождей. То есть тропические грибы буквально формируют для себя подходящую влажную среду.\n" +
                "\"", "https://lifehacker.ru/udivitelnye-fakty-o-gribax/"));
        return themeCards;
    };


}
